#-----------------------------------------------
#№1
#-----------------------------------------------
x = 0


def outer():
    x = 1

    def inner():
        x = 2
        print("inner:", x)

    inner()
    print("outer:", x)


outer()
print("global:", x)
#----------------------------------------------
#inner: 2
#outer: 1
#global: 0
#----------------------------------------------

#----------------------------------------------
#№2 nonlocal
#----------------------------------------------
x = 0


def outer():
    x = 1

    def inner():
        nonlocal x
        x = 2
        print("inner:", x)

    inner()
    print("outer:", x)


outer()
print("global:", x)
#----------------------------------------------
#inner: 2
#outer: 2
#global: 0
#----------------------------------------------

#----------------------------------------------
#№3 global
#----------------------------------------------
x = 0


def outer():
    global x
    x = 1

    def inner():
        global x  #если напишем nonlocal будет ошибка 
        print("inner:", x)

    inner()
    print("outer:", x)


outer()
print("global:", x)
#----------------------------------------------
#inner: 2
#outer: 2
#global: 2
#----------------------------------------------
